## Plan Result (883: sbox_landing - TerraformPlanApply)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 162 to add, 18 to change, 192 to destroy.</code></pre>

* Create
  * azurerm_role_assignment.roles[&#34;05-ingest05-main-sbox-User-Owner-Andrew.McMahon4@justice.gov.uk&#34;]
  * azurerm_role_assignment.roles[&#34;05-ingest05-main-sbox-User-Owner-Michael.Hayes_justice.gov.uk#EXT#@HMCTS.NET&#34;]
  * azurerm_role_assignment.roles[&#34;05-ingest05-main-sbox-User-Storage-Blob-Data-Owner-Andrew.McMahon4@justice.gov.uk&#34;]
  * azurerm_role_assignment.roles[&#34;05-ingest05-main-sbox-User-Storage-Blob-Data-Owner-Michael.Hayes_justice.gov.uk#EXT#@HMCTS.NET&#34;]
  * module.data_landing_zone[&#34;05&#34;].azurerm_resource_group.this[&#34;main&#34;]
* Update
  * module.data_landing_zone[&#34;00&#34;].azurerm_eventhub_namespace.this
  * module.data_landing_zone[&#34;00&#34;].azurerm_resource_group.this[&#34;main&#34;]
  * module.data_landing_zone[&#34;05&#34;].azurerm_synapse_workspace_aad_admin.aad
  * module.logic[&#34;05&#34;].azurerm_logic_app_standard.this
  * module.data_landing_zone[&#34;00&#34;].module.metadata_mssql.azurerm_mssql_database.this[&#34;MetadataControl&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.metadata_mssql.azurerm_mssql_server.this
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;curated&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;external&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;landing&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;raw&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;workspace&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;01&#34;].module.metadata_mssql.azurerm_mssql_database.this[&#34;MetadataControl&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.metadata_mssql.azurerm_mssql_server.this
  * module.data_landing_zone[&#34;01&#34;].module.storage[&#34;curated&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;01&#34;].module.storage[&#34;external&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;01&#34;].module.storage[&#34;landing&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;01&#34;].module.storage[&#34;raw&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;01&#34;].module.storage[&#34;workspace&#34;].azurerm_storage_account.storage_account
* Delete
  * azurerm_role_assignment.roles[&#34;05-ingest05-external-storage-sbox-User-Owner-Andrew.McMahon4@justice.gov.uk&#34;]
  * azurerm_role_assignment.roles[&#34;05-ingest05-external-storage-sbox-User-Owner-Michael.Hayes_justice.gov.uk#EXT#@HMCTS.NET&#34;]
  * azurerm_role_assignment.roles[&#34;05-ingest05-external-storage-sbox-User-Storage-Blob-Data-Owner-Andrew.McMahon4@justice.gov.uk&#34;]
  * azurerm_role_assignment.roles[&#34;05-ingest05-external-storage-sbox-User-Storage-Blob-Data-Owner-Michael.Hayes_justice.gov.uk#EXT#@HMCTS.NET&#34;]
  * azurerm_role_assignment.roles[&#34;05-ingest05-logging-sbox-User-Owner-Andrew.McMahon4@justice.gov.uk&#34;]
  * azurerm_role_assignment.roles[&#34;05-ingest05-logging-sbox-User-Owner-Michael.Hayes_justice.gov.uk#EXT#@HMCTS.NET&#34;]
  * azurerm_role_assignment.roles[&#34;05-ingest05-logging-sbox-User-Storage-Blob-Data-Owner-Andrew.McMahon4@justice.gov.uk&#34;]
  * azurerm_role_assignment.roles[&#34;05-ingest05-logging-sbox-User-Storage-Blob-Data-Owner-Michael.Hayes_justice.gov.uk#EXT#@HMCTS.NET&#34;]
  * azurerm_role_assignment.roles[&#34;05-ingest05-metadata-sbox-User-Owner-Andrew.McMahon4@justice.gov.uk&#34;]
  * azurerm_role_assignment.roles[&#34;05-ingest05-metadata-sbox-User-Owner-Michael.Hayes_justice.gov.uk#EXT#@HMCTS.NET&#34;]
  * azurerm_role_assignment.roles[&#34;05-ingest05-metadata-sbox-User-Storage-Blob-Data-Owner-Andrew.McMahon4@justice.gov.uk&#34;]
  * azurerm_role_assignment.roles[&#34;05-ingest05-metadata-sbox-User-Storage-Blob-Data-Owner-Michael.Hayes_justice.gov.uk#EXT#@HMCTS.NET&#34;]
  * azurerm_role_assignment.roles[&#34;05-ingest05-runtimes-sbox-User-Owner-Andrew.McMahon4@justice.gov.uk&#34;]
  * azurerm_role_assignment.roles[&#34;05-ingest05-runtimes-sbox-User-Owner-Michael.Hayes_justice.gov.uk#EXT#@HMCTS.NET&#34;]
  * azurerm_role_assignment.roles[&#34;05-ingest05-runtimes-sbox-User-Storage-Blob-Data-Owner-Andrew.McMahon4@justice.gov.uk&#34;]
  * azurerm_role_assignment.roles[&#34;05-ingest05-runtimes-sbox-User-Storage-Blob-Data-Owner-Michael.Hayes_justice.gov.uk#EXT#@HMCTS.NET&#34;]
  * azurerm_role_assignment.roles[&#34;05-ingest05-shared-integration-sbox-User-Owner-Andrew.McMahon4@justice.gov.uk&#34;]
  * azurerm_role_assignment.roles[&#34;05-ingest05-shared-integration-sbox-User-Owner-Michael.Hayes_justice.gov.uk#EXT#@HMCTS.NET&#34;]
  * azurerm_role_assignment.roles[&#34;05-ingest05-shared-integration-sbox-User-Storage-Blob-Data-Owner-Andrew.McMahon4@justice.gov.uk&#34;]
  * azurerm_role_assignment.roles[&#34;05-ingest05-shared-integration-sbox-User-Storage-Blob-Data-Owner-Michael.Hayes_justice.gov.uk#EXT#@HMCTS.NET&#34;]
  * azurerm_role_assignment.roles[&#34;05-ingest05-shared-product-sbox-User-Owner-Andrew.McMahon4@justice.gov.uk&#34;]
  * azurerm_role_assignment.roles[&#34;05-ingest05-shared-product-sbox-User-Owner-Michael.Hayes_justice.gov.uk#EXT#@HMCTS.NET&#34;]
  * azurerm_role_assignment.roles[&#34;05-ingest05-shared-product-sbox-User-Storage-Blob-Data-Owner-Andrew.McMahon4@justice.gov.uk&#34;]
  * azurerm_role_assignment.roles[&#34;05-ingest05-shared-product-sbox-User-Storage-Blob-Data-Owner-Michael.Hayes_justice.gov.uk#EXT#@HMCTS.NET&#34;]
  * azurerm_role_assignment.roles[&#34;05-ingest05-storage-sbox-User-Owner-Andrew.McMahon4@justice.gov.uk&#34;]
  * azurerm_role_assignment.roles[&#34;05-ingest05-storage-sbox-User-Owner-Michael.Hayes_justice.gov.uk#EXT#@HMCTS.NET&#34;]
  * azurerm_role_assignment.roles[&#34;05-ingest05-storage-sbox-User-Storage-Blob-Data-Owner-Andrew.McMahon4@justice.gov.uk&#34;]
  * azurerm_role_assignment.roles[&#34;05-ingest05-storage-sbox-User-Storage-Blob-Data-Owner-Michael.Hayes_justice.gov.uk#EXT#@HMCTS.NET&#34;]
  * module.data_landing_zone[&#34;05&#34;].azurerm_resource_group.this[&#34;external-storage&#34;]
  * module.data_landing_zone[&#34;05&#34;].azurerm_resource_group.this[&#34;logging&#34;]
  * module.data_landing_zone[&#34;05&#34;].azurerm_resource_group.this[&#34;metadata&#34;]
  * module.data_landing_zone[&#34;05&#34;].azurerm_resource_group.this[&#34;runtimes&#34;]
  * module.data_landing_zone[&#34;05&#34;].azurerm_resource_group.this[&#34;shared-integration&#34;]
  * module.data_landing_zone[&#34;05&#34;].azurerm_resource_group.this[&#34;shared-product&#34;]
  * module.data_landing_zone[&#34;05&#34;].azurerm_resource_group.this[&#34;storage&#34;]
* Replace
  * module.data_landing_zone[&#34;05&#34;].azurerm_data_factory_integration_runtime_self_hosted.this
  * module.data_landing_zone[&#34;05&#34;].azurerm_eventhub_namespace.this
  * module.data_landing_zone[&#34;05&#34;].azurerm_key_vault_access_policy.arm_secret_access[&#34;meta001&#34;]
  * module.data_landing_zone[&#34;05&#34;].azurerm_key_vault_access_policy.arm_secret_access[&#34;meta002&#34;]
  * module.data_landing_zone[&#34;05&#34;].azurerm_key_vault_access_policy.logging_vault_reders[&#34;145da22b-a3cb-4ba8-b735-22c94b5eea6c&#34;]
  * module.data_landing_zone[&#34;05&#34;].azurerm_key_vault_access_policy.metadata_vault_reders[&#34;145da22b-a3cb-4ba8-b735-22c94b5eea6c-meta001&#34;]
  * module.data_landing_zone[&#34;05&#34;].azurerm_key_vault_access_policy.metadata_vault_reders[&#34;145da22b-a3cb-4ba8-b735-22c94b5eea6c-meta002&#34;]
  * module.data_landing_zone[&#34;05&#34;].azurerm_key_vault_access_policy.runtimes_datafactory[&#34;meta001&#34;]
  * module.data_landing_zone[&#34;05&#34;].azurerm_key_vault_access_policy.runtimes_datafactory[&#34;meta002&#34;]
  * module.data_landing_zone[&#34;05&#34;].azurerm_key_vault_access_policy.shared_integration_datafactory[&#34;meta001&#34;]
  * module.data_landing_zone[&#34;05&#34;].azurerm_key_vault_access_policy.shared_integration_datafactory[&#34;meta002&#34;]
  * module.data_landing_zone[&#34;05&#34;].azurerm_key_vault_secret.legacy_database_password[&#34;legacy-sql&#34;]
  * module.data_landing_zone[&#34;05&#34;].azurerm_key_vault_secret.legacy_database_username[&#34;legacy-sql&#34;]
  * module.data_landing_zone[&#34;05&#34;].azurerm_key_vault_secret.log_analytics_workspace_id
  * module.data_landing_zone[&#34;05&#34;].azurerm_key_vault_secret.log_analytics_workspace_secret
  * module.data_landing_zone[&#34;05&#34;].azurerm_key_vault_secret.mssql_password
  * module.data_landing_zone[&#34;05&#34;].azurerm_key_vault_secret.mssql_username
  * module.data_landing_zone[&#34;05&#34;].azurerm_key_vault_secret.mysql_connection_string
  * module.data_landing_zone[&#34;05&#34;].azurerm_key_vault_secret.mysql_password
  * module.data_landing_zone[&#34;05&#34;].azurerm_key_vault_secret.mysql_username
  * module.data_landing_zone[&#34;05&#34;].azurerm_key_vault_secret.synapse_sql_password
  * module.data_landing_zone[&#34;05&#34;].azurerm_key_vault_secret.synapse_sql_username
  * module.data_landing_zone[&#34;05&#34;].azurerm_log_analytics_workspace.this
  * module.data_landing_zone[&#34;05&#34;].azurerm_monitor_diagnostic_setting.runtimes_datafactory
  * module.data_landing_zone[&#34;05&#34;].azurerm_monitor_diagnostic_setting.shared_integration_datafactory
  * module.data_landing_zone[&#34;05&#34;].azurerm_role_assignment.datafactory_databricks
  * module.data_landing_zone[&#34;05&#34;].azurerm_role_assignment.runtimes_datafactory_storage[&#34;curated&#34;]
  * module.data_landing_zone[&#34;05&#34;].azurerm_role_assignment.runtimes_datafactory_storage[&#34;external&#34;]
  * module.data_landing_zone[&#34;05&#34;].azurerm_role_assignment.runtimes_datafactory_storage[&#34;landing&#34;]
  * module.data_landing_zone[&#34;05&#34;].azurerm_role_assignment.runtimes_datafactory_storage[&#34;raw&#34;]
  * module.data_landing_zone[&#34;05&#34;].azurerm_role_assignment.runtimes_datafactory_storage[&#34;workspace&#34;]
  * module.data_landing_zone[&#34;05&#34;].azurerm_role_assignment.shared_integration_datafactory_storage[&#34;curated&#34;]
  * module.data_landing_zone[&#34;05&#34;].azurerm_role_assignment.shared_integration_datafactory_storage[&#34;external&#34;]
  * module.data_landing_zone[&#34;05&#34;].azurerm_role_assignment.shared_integration_datafactory_storage[&#34;landing&#34;]
  * module.data_landing_zone[&#34;05&#34;].azurerm_role_assignment.shared_integration_datafactory_storage[&#34;raw&#34;]
  * module.data_landing_zone[&#34;05&#34;].azurerm_role_assignment.shared_integration_datafactory_storage[&#34;workspace&#34;]
  * module.data_landing_zone[&#34;05&#34;].azurerm_storage_data_lake_gen2_filesystem.this[&#34;curated&#34;]
  * module.data_landing_zone[&#34;05&#34;].azurerm_storage_data_lake_gen2_filesystem.this[&#34;external&#34;]
  * module.data_landing_zone[&#34;05&#34;].azurerm_storage_data_lake_gen2_filesystem.this[&#34;landing&#34;]
  * module.data_landing_zone[&#34;05&#34;].azurerm_storage_data_lake_gen2_filesystem.this[&#34;raw&#34;]
  * module.data_landing_zone[&#34;05&#34;].azurerm_storage_data_lake_gen2_filesystem.this[&#34;workspace&#34;]
  * module.data_landing_zone[&#34;05&#34;].azurerm_storage_management_policy.this[&#34;curated&#34;]
  * module.data_landing_zone[&#34;05&#34;].azurerm_storage_management_policy.this[&#34;external&#34;]
  * module.data_landing_zone[&#34;05&#34;].azurerm_storage_management_policy.this[&#34;landing&#34;]
  * module.data_landing_zone[&#34;05&#34;].azurerm_storage_management_policy.this[&#34;raw&#34;]
  * module.data_landing_zone[&#34;05&#34;].azurerm_storage_management_policy.this[&#34;workspace&#34;]
  * module.data_landing_zone[&#34;05&#34;].azurerm_synapse_workspace.this
  * module.data_landing_zone[&#34;05&#34;].azurerm_virtual_machine_run_command.bootstrap_script[&#34;legacy-sql&#34;]
  * module.data_landing_zone[&#34;05&#34;].module.legacy_database[&#34;legacy-sql&#34;].azurerm_linux_virtual_machine.linvm[0]
  * module.data_landing_zone[&#34;05&#34;].module.legacy_database[&#34;legacy-sql&#34;].azurerm_network_interface.vm_nic
  * module.data_landing_zone[&#34;05&#34;].module.logging_vault.azurerm_key_vault.kv
  * module.data_landing_zone[&#34;05&#34;].module.logging_vault.azurerm_key_vault_access_policy.creator_access_policy
  * module.data_landing_zone[&#34;05&#34;].module.logging_vault.azurerm_key_vault_access_policy.developer[0]
  * module.data_landing_zone[&#34;05&#34;].module.logging_vault.azurerm_key_vault_access_policy.product_team_access_policy
  * module.data_landing_zone[&#34;05&#34;].module.logging_vault.azurerm_monitor_diagnostic_setting.kv-ds
  * module.data_landing_zone[&#34;05&#34;].module.logging_vault_pe.azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;05&#34;].module.metadata_mssql.azurerm_mssql_database.this[&#34;MetadataControl&#34;]
  * module.data_landing_zone[&#34;05&#34;].module.metadata_mssql.azurerm_mssql_server.this
  * module.data_landing_zone[&#34;05&#34;].module.metadata_mssql.azurerm_private_endpoint.metadata_mssql_pe[0]
  * module.data_landing_zone[&#34;05&#34;].module.metadata_mysql.azurerm_mysql_flexible_database.this[&#34;ingest05-HiveMetastoreDb-sbox&#34;]
  * module.data_landing_zone[&#34;05&#34;].module.metadata_mysql.azurerm_mysql_flexible_server.this
  * module.data_landing_zone[&#34;05&#34;].module.metadata_vault[&#34;meta001&#34;].azurerm_key_vault.kv
  * module.data_landing_zone[&#34;05&#34;].module.metadata_vault[&#34;meta001&#34;].azurerm_key_vault_access_policy.creator_access_policy
  * module.data_landing_zone[&#34;05&#34;].module.metadata_vault[&#34;meta001&#34;].azurerm_key_vault_access_policy.developer[0]
  * module.data_landing_zone[&#34;05&#34;].module.metadata_vault[&#34;meta001&#34;].azurerm_key_vault_access_policy.product_team_access_policy
  * module.data_landing_zone[&#34;05&#34;].module.metadata_vault[&#34;meta001&#34;].azurerm_monitor_diagnostic_setting.kv-ds
  * module.data_landing_zone[&#34;05&#34;].module.metadata_vault[&#34;meta002&#34;].azurerm_key_vault.kv
  * module.data_landing_zone[&#34;05&#34;].module.metadata_vault[&#34;meta002&#34;].azurerm_key_vault_access_policy.creator_access_policy
  * module.data_landing_zone[&#34;05&#34;].module.metadata_vault[&#34;meta002&#34;].azurerm_key_vault_access_policy.developer[0]
  * module.data_landing_zone[&#34;05&#34;].module.metadata_vault[&#34;meta002&#34;].azurerm_key_vault_access_policy.product_team_access_policy
  * module.data_landing_zone[&#34;05&#34;].module.metadata_vault[&#34;meta002&#34;].azurerm_monitor_diagnostic_setting.kv-ds
  * module.data_landing_zone[&#34;05&#34;].module.metadata_vault_pe[&#34;meta001&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;05&#34;].module.metadata_vault_pe[&#34;meta002&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;05&#34;].module.runtimes_datafactory.azurerm_data_factory.this
  * module.data_landing_zone[&#34;05&#34;].module.runtimes_datafactory.azurerm_data_factory_integration_runtime_azure.this
  * module.data_landing_zone[&#34;05&#34;].module.runtimes_datafactory.azurerm_data_factory_linked_service_azure_blob_storage.this[&#34;ingest05landingsbox&#34;]
  * module.data_landing_zone[&#34;05&#34;].module.runtimes_datafactory.azurerm_data_factory_linked_service_key_vault.this[&#34;ingest05-meta002-sbox&#34;]
  * module.data_landing_zone[&#34;05&#34;].module.runtimes_datafactory.azurerm_data_factory_managed_private_endpoint.dependants[&#34;purview-eventhub&#34;]
  * module.data_landing_zone[&#34;05&#34;].module.runtimes_datafactory.azurerm_data_factory_managed_private_endpoint.dependants[&#34;purview-storage-blob&#34;]
  * module.data_landing_zone[&#34;05&#34;].module.runtimes_datafactory.azurerm_data_factory_managed_private_endpoint.dependants[&#34;purview-storage-queue&#34;]
  * module.data_landing_zone[&#34;05&#34;].module.runtimes_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;keyvault&#34;]
  * module.data_landing_zone[&#34;05&#34;].module.runtimes_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;landing-blob&#34;]
  * module.data_landing_zone[&#34;05&#34;].module.runtimes_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;landing-dfs&#34;]
  * module.data_landing_zone[&#34;05&#34;].module.runtimes_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;purview&#34;]
  * module.data_landing_zone[&#34;05&#34;].module.runtimes_datafactory.azurerm_private_endpoint.this[&#34;dataFactory&#34;]
  * module.data_landing_zone[&#34;05&#34;].module.runtimes_datafactory.azurerm_private_endpoint.this[&#34;portal&#34;]
  * module.data_landing_zone[&#34;05&#34;].module.shared_integration_databricks.azurerm_databricks_workspace.this
  * module.data_landing_zone[&#34;05&#34;].module.shared_integration_datafactory.azurerm_data_factory.this
  * module.data_landing_zone[&#34;05&#34;].module.shared_integration_datafactory.azurerm_data_factory_integration_runtime_azure.this
  * module.data_landing_zone[&#34;05&#34;].module.shared_integration_datafactory.azurerm_data_factory_linked_service_azure_blob_storage.this[&#34;ingest05curatedsbox&#34;]
  * module.data_landing_zone[&#34;05&#34;].module.shared_integration_datafactory.azurerm_data_factory_linked_service_azure_blob_storage.this[&#34;ingest05rawsbox&#34;]
  * module.data_landing_zone[&#34;05&#34;].module.shared_integration_datafactory.azurerm_data_factory_linked_service_azure_databricks.this[&#34;ingest05-integration-databricks001-sbox&#34;]
  * module.data_landing_zone[&#34;05&#34;].module.shared_integration_datafactory.azurerm_data_factory_linked_service_azure_sql_database.this[&#34;MetadataControl&#34;]
  * module.data_landing_zone[&#34;05&#34;].module.shared_integration_datafactory.azurerm_data_factory_linked_service_key_vault.this[&#34;ingest05-meta001-sbox&#34;]
  * module.data_landing_zone[&#34;05&#34;].module.shared_integration_datafactory.azurerm_data_factory_linked_service_key_vault.this[&#34;ingest05-meta002-sbox&#34;]
  * module.data_landing_zone[&#34;05&#34;].module.shared_integration_datafactory.azurerm_data_factory_linked_service_sql_server.this[&#34;ingest05-metadata-mssql-sbox&#34;]
  * module.data_landing_zone[&#34;05&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.dependants[&#34;purview-eventhub&#34;]
  * module.data_landing_zone[&#34;05&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.dependants[&#34;purview-storage-blob&#34;]
  * module.data_landing_zone[&#34;05&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.dependants[&#34;purview-storage-queue&#34;]
  * module.data_landing_zone[&#34;05&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;curated-blob&#34;]
  * module.data_landing_zone[&#34;05&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;curated-dfs&#34;]
  * module.data_landing_zone[&#34;05&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;keyvault&#34;]
  * module.data_landing_zone[&#34;05&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;landing-blob&#34;]
  * module.data_landing_zone[&#34;05&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;landing-dfs&#34;]
  * module.data_landing_zone[&#34;05&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;mssql&#34;]
  * module.data_landing_zone[&#34;05&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;purview&#34;]
  * module.data_landing_zone[&#34;05&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;raw-blob&#34;]
  * module.data_landing_zone[&#34;05&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;raw-dfs&#34;]
  * module.data_landing_zone[&#34;05&#34;].module.shared_integration_datafactory.azurerm_private_endpoint.this[&#34;dataFactory&#34;]
  * module.data_landing_zone[&#34;05&#34;].module.shared_integration_datafactory.azurerm_private_endpoint.this[&#34;portal&#34;]
  * module.data_landing_zone[&#34;05&#34;].module.shared_integration_eventhub_pe.azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;05&#34;].module.shared_product_databricks.azurerm_databricks_workspace.this
  * module.data_landing_zone[&#34;05&#34;].module.storage[&#34;curated&#34;].azapi_update_resource.defender_settings
  * module.data_landing_zone[&#34;05&#34;].module.storage[&#34;curated&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;05&#34;].module.storage[&#34;external&#34;].azapi_update_resource.defender_settings
  * module.data_landing_zone[&#34;05&#34;].module.storage[&#34;external&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;05&#34;].module.storage[&#34;landing&#34;].azapi_update_resource.defender_settings
  * module.data_landing_zone[&#34;05&#34;].module.storage[&#34;landing&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;05&#34;].module.storage[&#34;raw&#34;].azapi_update_resource.defender_settings
  * module.data_landing_zone[&#34;05&#34;].module.storage[&#34;raw&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;05&#34;].module.storage[&#34;workspace&#34;].azapi_update_resource.defender_settings
  * module.data_landing_zone[&#34;05&#34;].module.storage[&#34;workspace&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;05&#34;].module.storage_pe[&#34;curated-blob&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;05&#34;].module.storage_pe[&#34;curated-dfs&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;05&#34;].module.storage_pe[&#34;external-blob&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;05&#34;].module.storage_pe[&#34;external-dfs&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;05&#34;].module.storage_pe[&#34;landing-blob&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;05&#34;].module.storage_pe[&#34;landing-dfs&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;05&#34;].module.storage_pe[&#34;raw-blob&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;05&#34;].module.storage_pe[&#34;raw-dfs&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;05&#34;].module.storage_pe[&#34;workspace-blob&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;05&#34;].module.storage_pe[&#34;workspace-dfs&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;05&#34;].module.synapse_pe[&#34;dev&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;05&#34;].module.synapse_pe[&#34;sql&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;05&#34;].module.synapse_pe[&#34;sqlOnDemand&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;05&#34;].module.legacy_database[&#34;legacy-sql&#34;].module.vm-bootstrap[0].azurerm_monitor_data_collection_rule_association.linux_vm_dcra[0]
  * module.data_landing_zone[&#34;05&#34;].module.legacy_database[&#34;legacy-sql&#34;].module.vm-bootstrap[0].azurerm_virtual_machine_extension.azure_monitor[0]
  * module.data_landing_zone[&#34;05&#34;].module.legacy_database[&#34;legacy-sql&#34;].module.vm-bootstrap[0].azurerm_virtual_machine_extension.custom_script[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_role_assignment.roles["05-ingest05-external-storage-sbox-User-Owner-Andrew.McMahon4@justice.gov.uk"] will be destroyed
  # (because key ["05-ingest05-external-storage-sbox-User-Owner-Andrew.McMahon4@justice.gov.uk"] is not in for_each map)
  - resource "azurerm_role_assignment" "roles" {
      - id                                     = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest05-external-storage-sbox/providers/Microsoft.Authorization/roleAssignments/4ad4f166-987d-13d2-e1ad-d854b0d836d7" -> null
      - name                                   = "4ad4f166-987d-13d2-e1ad-d854b0d836d7" -> null
      - principal_id                           = "3f4489a3-7255-40e6-b3fa-4886be31f355" -> null
      - principal_type                         = "User" -> null
      - role_definition_id                     = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/providers/Microsoft.Authorization/roleDefinitions/8e3af657-a8ff-443c-a75c-2fe8c4bcb635" -> null
      - role_definition_name                   = "Owner" -> null
      - scope                                  = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest05-external-storage-sbox" -> null
        # (4 unchanged attributes hidden)
    }

  # azurerm_role_assignment.roles["05-ingest05-external-storage-sbox-User-Owner-Michael.Hayes_justice.gov.uk#EXT#@HMCTS.NET"] will be destroyed
  # (because key ["05-ingest05-external-storage-sbox-User-Owner-Michael.Hayes_justice.gov.uk#EXT#@HMCTS.NET"] is not in for_each map)
  - resource "azurerm_role_assignment" "roles" {
      - id                                     = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest05-external-storage-sbox/providers/Microsoft.Authorization/roleAssignments/21116acd-2e8a-f854-c079-9c77bd20ba01" -> null
      - name                                   = "21116acd-2e8a-f854-c079-9c77bd20ba01" -> null
      - principal_id                           = "d4936fd4-1c48-4b82-a660-1b4a53b6a4d9" -> null
      - principal_type                         = "User" -> null
      - role_definition_id                     = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/providers/Microsoft.Authorization/roleDefinitions/8e3af657-a8ff-443c-a75c-2fe8c4bcb635" -> null
      - role_definition_name                   = "Owner" -> null
      - scope                                  = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest05-external-storage-sbox" -> null
        # (4 unchanged attributes hidden)
    }

  # azurerm_role_assignment.roles["05-ingest05-external-storage-sbox-User-Storage-Blob-Data-Owner-Andrew.McMahon4@justice.gov.uk"] will be destroyed
  # (because key ["05-ingest05-external-storage-sbox-User-Storage-Blob-Data-Owner-Andrew.McMahon4@justice.gov.uk"] is not in for_each map)
  - resource "azurerm_role_assignment" "roles" {
      - id                                     = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest05-external-storage-sbox/providers/Microsoft.Authorization/roleAssignments/f914a325-12b3-f71a-6c8f-f0e13aab13fc" -> null
      - name                                   = "f914a325-12b3-f71a-6c8f-f0e13aab13fc" -> null
      - principal_id                           = "3f4489a3-7255-40e6-b3fa-4886be31f355" -> null
      - principal_type                         = "User" -> null
      - role_definition_id                     = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/providers/Microsoft.Authorization/roleDefinitions/b7e6dc6d-f1e8-4753-8033-0f276bb0955b" -> null
      - role_definition_name                   = "Storage Blob Data Owner" -> null
      - scope                                  = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest05-external-storage-sbox" -> null
        # (4 unchanged attributes hidden)
    }

  # azurerm_role_assignment.roles["05-ingest05-external-storage-sbox-User-Storage-Blob-Data-Owner-Michael.Hayes_justice.gov.uk#EXT#@HMCTS.NET"] will be destroyed
  # (because key ["05-ingest05-external-storage-sbox-User-Storage-Blob-Data-Owner-Michael.Hayes_justice.gov.uk#EXT#@HMCTS.NET"] is not in for_each map)
  - resource "azurerm_role_assignment" "roles" {
      - id                                     = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest05-external-storage-sbox/providers/Microsoft.Authorization/roleAssignments/1d67de8d-4e9a-faeb-64f0-a8469591acb4" -> null
      - name                                   = "1d67de8d-4e9a-faeb-64f0-a8469591acb4" -> null
      - principal_id                           = "d4936fd4-1c48-4b82-a660-1b4a53b6a4d9" -> null
      - principal_type                         = "User" -> null
      - role_definition_id                     = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/providers/Microsoft.Authorization/roleDefinitions/b7e6dc6d-f1e8-4753-8033-0f276bb0955b" -> null
      - role_definition_name                   = "Storage Blob Data Owner" -> null
      - scope                                  = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest05-external-storage-sbox" -> null
        # (4 unchanged attributes hidden)
    }

  # azurerm_role_assignment.roles["05-ingest05-logging-sbox-User-Owner-Andrew.McMahon4@justice.gov.uk"] will be destroyed
  # (because key ["05-ingest05-logging-sbox-User-Owner-Andrew.McMahon4@justice.gov.uk"] is not in for_each map)
  - resource "azurerm_role_assignment" "roles" {
      - id                                     = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest05-logging-sbox/providers/Microsoft.Authorization/roleAssignments/3c952395-dad2-4398-5219-887bdb7a8a39" -> null
      - name                                   = "3c952395-dad2-4398-5219-887bdb7a8a39" -> null
      - principal_id                           = "3f4489a3-7255-40e6-b3fa-4886be31f355" -> null
      - principal_type                         = "User" -> null
      - role_definition_id                     = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/providers/Microsoft.Authorization/roleDefinitions/8e3af657-a8ff-443c-a75c-2fe8c4bcb635" -> null
      - role_definition_name                   = "Owner" -> null
      - scope                                  = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest05-logging-sbox" -> null
        # (4 unchanged attributes hidden)
    }

  # azurerm_role_assignment.roles["05-ingest05-logging-sbox-User-Owner-Michael.Hayes_justice.gov.uk#EXT#@HMCTS.NET"] will be destroyed
  # (because key ["05-ingest05-logging-sbox-User-Owner-Michael.Hayes_justice.gov.uk#EXT#@HMCTS.NET"] is not in for_each map)
  - resource "azurerm_role_assignment" "roles" {
      - id                                     = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest05-logging-sbox/providers/Microsoft.Authorization/roleAssignments/6e74c921-6f3b-2cd5-1ffe-1fd0d7eff446" -> null
      - name                                   = "6e74c921-6f3b-2cd5-1ffe-1fd0d7eff446" -> null
      - principal_id                           = "d4936fd4-1c48-4b82-a660-1b4a53b6a4d9" -> null
      - principal_type                         = "User" -> null
      - role_definition_id                     = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/providers/Microsoft.Authorization/roleDefinitions/8e3af657-a8ff-443c-a75c-2fe8c4bcb635" -> null
      - role_definition_name                   = "Owner" -> null
      - scope                                  = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest05-logging-sbox" -> null
        # (4 unchanged attributes hidden)
    }

  # azurerm_role_assignment.roles["05-ingest05-logging-sbox-User-Storage-Blob-Data-Owner-Andrew.McMahon4@justice.gov.uk"] will be destroyed
  # (because key ["05-ingest05-logging-sbox-User-Storage-Blob-Data-Owner-Andrew.McMahon4@justice.gov.uk"] is not in for_each map)
  - resource "azurerm_role_assignment" "roles" {
      - id                                     = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest05-logging-sbox/providers/Microsoft.Authorization/roleAssignments/8a640916-840f-9633-882c-7fbe4d748dd7" -> null
      - name                                   = "8a640916-840f-9633-882c-7fbe4d748dd7" -> null
      - principal_id                           = "3f4489a3-7255-40e6-b3fa-4886be31f355" -> null
      - principal_type                         = "User" -> null
      - role_definition_id                     = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/providers/Microsoft.Authorization/roleDefinitions/b7e6dc6d-f1e8-4753-8033-0f276bb0955b" -> null
      - role_definition_name                   = "Storage Blob Data Owner" -> null
      - scope                                  = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest05-logging-sbox" -> null
        # (4 unchanged attributes hidden)
    }

  # azurerm_role_assignment.roles["05-ingest05-logging-sbox-User-Storage-Blob-Data-Owner-Michael.Hayes_justice.gov.uk#EXT#@HMCTS.NET"] will be destroyed
  # (because key ["05-ingest05-logging-sbox-User-Storage-Blob-Data-Owner-Michael.Hayes_justice.gov.uk#EXT#@HMCTS.NET"] is not in for_each map)
  - resource "azurerm_role_assignment" "roles" {
      - id                                     = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest05-logging-sbox/providers/Microsoft.Authorization/roleAssignments/ee92d64a-037a-6795-a41d-e4fc0cc9cc2f" -> null
      - name                                   = "ee92d64a-037a-6795-a41d-e4fc0cc9cc2f" -> null
      - principal_id                           = "d4936fd4-1c48-4b82-a660-1b4a53b6a4d9" -> null
      - principal_type                         = "User" -> null
      - role_definition_id                     = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/providers/Microsoft.Authorization/roleDefinitions/b7e6dc6d-f1e8-4753-8033-0f276bb0955b" -> null
      - role_definition_name                   = "Storage Blob Data Owner" -> null
      - scope                                  = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest05-logging-sbox" -> null
        # (4 unchanged attributes hidden)
    }

  # azurerm_role_assignment.roles["05-ingest05-main-sbox-User-Owner-Andrew.McMahon4@justice.gov.uk"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "3f4489a3-7255-40e6-b3fa-4886be31f355"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["05-ingest05-main-sbox-User-Owner-Michael.Hayes_justice.gov.uk#EXT#@HMCTS.NET"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "d4936fd4-1c48-4b82-a660-1b4a53b6a4d9"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["05-ingest05-main-sbox-User-Storage-Blob-Data-Owner-Andrew.McMahon4@justice.gov.uk"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "3f4489a3-7255-40e6-b3fa-4886be31f355"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Owner"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["05-ingest05-main-sbox-User-Storage-Blob-Data-Owner-Michael.Hayes_justice.gov.uk#EXT#@HMCTS.NET"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "d4936fd4-1c48-4b82-a660-1b4a53b6a4d9"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Owner"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["05-ingest05-metadata-sbox-User-Owner-Andrew.McMahon4@justice.gov.uk"] will be destroyed
  # (because key ["05-ingest05-metadata-sbox-User-Owner-Andrew.McMahon4@justice.gov.uk"] is not in for_each map)
  - resource "azurerm_role_assignment" "roles" {
      - id                                     = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest05-metadata-sbox/providers/Microsoft.Authorization/roleAssignments/bc8c01c1-8916-821e-6055-81d186f352ee" -> null
      - name                                   = "bc8c01c1-8916-821e-6055-81d186f352ee" -> null
      - principal_id                           = "3f4489a3-7255-40e6-b3fa-4886be31f355" -> null
      - principal_type                         = "User" -> null
      - role_definition_id                     = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/providers/Microsoft.Authorization/roleDefinitions/8e3af657-a8ff-443c-a75c-2fe8c4bcb635" -> null
      - role_definition_name                   = "Owner" -> null
      - scope                                  = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest05-metadata-sbox" -> null
        # (4 unchanged attributes hidden)
    }

  # azurerm_role_assignment.roles["05-ingest05-metadata-sbox-User-Owner-Michael.Hayes_justice.gov.uk#EXT#@HMCTS.NET"] will be destroyed
  # (because key ["05-ingest05-metadata-sbox-User-Owner-Michael.Hayes_justice.gov.uk#EXT#@HMCTS.NET"] is not in for_each map)
  - resource "azurerm_role_assignment" "roles" {
      - id                                     = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest05-metadata-sbox/providers/Microsoft.Authorization/roleAssignments/de7fbdb5-22ed-299f-bd21-c703c7ad2d26" -> null
      - name                                   = "de7fbdb5-22ed-299f-bd21-c703c7ad2d26" -> null
      - principal_id                           = "d4936fd4-1c48-4b82-a660-1b4a53b6a4d9" -> null
      - principal_type                         = "User" -> null
      - role_definition_id                     = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/providers/Microsoft.Authorization/roleDefinitions/8e3af657-a8ff-443c-a75c-2fe8c4bcb635" -> null
      - role_definition_name                   = "Owner" -> null
      - scope                                  = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest05-metadata-sbox" -> null
        # (4 unchanged attributes hidden)
    }

  # azurerm_role_assignment.roles["05-ingest05-metadata-sbox-User-Storage-Blob-Data-Owner-Andrew.McMahon4@justice.gov.uk"] will be destroyed
  # (because key ["05-ingest05-metadata-sbox-User-Storage-Blob-Data-Owner-Andrew.McMahon4@justice.gov.uk"] is not in for_each map)
  - resource "azurerm_role_assignment" "roles" {
      - id                                     = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest05-metadata-sbox/providers/Microsoft.Authorization/roleAssignments/7d93d9d3-2940-3edf-ecc6-9a1e99874ded" -> null
      - name                                   = "7d93d9d3-2940-3edf-ecc6-9a1e99874ded" -> null
      - principal_id                           = "3f4489a3-7255-40e6-b3fa-4886be31f355" -> null
      - principal_type                         = "User" -> null
      - role_definition_id                     = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/providers/Microsoft.Authorization/roleDefinitions/b7e6dc6d-f1e8-4753-8033-0f276bb0955b" -> null
      - role_definition_name                   = "Storage Blob Data Owner" -> null
      - scope                                  = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest05-metadata-sbox" -> null
        # (4 unchanged attributes hidden)
    }

  # azurerm_role_assignment.roles["05-ingest05-metadata-sbox-User-Storage-Blob-Data-Owner-Michael.Hayes_justice.gov.uk#EXT#@HMCTS.NET"] will be destroyed
  # (because key ["05-ingest05-metadata-sbox-User-Storage-Blob-Data-Owner-Michael.Hayes_justice.gov.uk#EXT#@HMCTS.NET"] is not in for_each map)
  - resource "azurerm_role_assignment" "roles" {
      - id                                     = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest05-metadata-sbox/providers/Microsoft.Authorization/roleAssignments/33dae1d4-5be9-2a4c-8dcd-229bafe1dfba" -> null
      - name                                   = "33dae1d4-5be9-2a4c-8dcd-229bafe1dfba" -> null
      - principal_id                           = "d4936fd4-1c48-4b82-a660-1b4a53b6a4d9" -> null
      - principal_type                         = "User" -> null
      - role_definition_id                     = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/providers/Microsoft.Authorization/roleDefinitions/b7e6dc6d-f1e8-4753-8033-0f276bb0955b" -> null
      - role_definition_name                   = "Storage Blob Data Owner" -> null
      - scope                                  = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest05-metadata-sbox" -> null
        # (4 unchanged attributes hidden)
    }

  # azurerm_role_assignment.roles["05-ingest05-runtimes-sbox-User-Owner-Andrew.McMahon4@justice.gov.uk"] will be destroyed
  # (because key ["05-ingest05-runtimes-sbox-User-Owner-Andrew.McMahon4@justice.gov.uk"] is not in for_each map)
  - resource "azurerm_role_assignment" "roles" {
      - id                                     = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest05-runtimes-sbox/providers/Microsoft.Authorization/roleAssignments/b60560aa-338c-688e-c440-f1238e727bf3" -> null
      - name                                   = "b60560aa-338c-688e-c440-f1238e727bf3" -> null
      - principal_id                           = "3f4489a3-7255-40e6-b3fa-4886be31f355" -> null
      - principal_type                         = "User" -> null
      - role_definition_id                     = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/providers/Microsoft.Authorization/roleDefinitions/8e3af657-a8ff-443c-a75c-2fe8c4bcb635" -> null
      - role_definition_name                   = "Owner" -> null
      - scope                                  = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest05-runtimes-sbox" -> null
        # (4 unchanged attributes hidden)
    }

  # azurerm_role_assignment.roles["05-ingest05-runtimes-sbox-User-Owner-Michael.Hayes_justice.gov.uk#EXT#@HMCTS.NET"] will be destroyed
  # (because key ["05-ingest05-runtimes-sbox-User-Owner-Michael.Hayes_justice.gov.uk#EXT#@H

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

              = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest05-storage-sbox/providers/Microsoft.Network/privateEndpoints/ingest05-workspace-blob-pe-sbox/privateDnsZoneGroups/endpoint-dnszonegroup" -> (known after apply)
            name                 = "endpoint-dnszonegroup"
            # (1 unchanged attribute hidden)
        }

      ~ private_service_connection {
            name                              = "ingest05workspacesbox"
          ~ private_connection_resource_id    = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest05-storage-sbox/providers/Microsoft.Storage/storageAccounts/ingest05workspacesbox" -> (known after apply) # forces replacement
          ~ private_ip_address                = "10.247.13.16" -> (known after apply)
            # (4 unchanged attributes hidden)
        }
    }

  # module.data_landing_zone["05"].module.storage_pe["workspace-dfs"].azurerm_private_endpoint.this must be replaced
-/+ resource "azurerm_private_endpoint" "this" {
      ~ custom_dns_configs            = [] -> (known after apply)
      ~ id                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest05-storage-sbox/providers/Microsoft.Network/privateEndpoints/ingest05-workspace-dfs-pe-sbox" -> (known after apply)
        name                          = "ingest05-workspace-dfs-pe-sbox"
      ~ network_interface             = [
          - {
              - id   = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest05-storage-sbox/providers/Microsoft.Network/networkInterfaces/ingest05-workspace-dfs-pe-sbox.nic.75a5f6ed-7735-48a7-9d54-36a87d5dff98"
              - name = "ingest05-workspace-dfs-pe-sbox.nic.75a5f6ed-7735-48a7-9d54-36a87d5dff98"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs      = [
          - {
              - id                  = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest05-storage-sbox/providers/Microsoft.Network/privateEndpoints/ingest05-workspace-dfs-pe-sbox/privateDnsZoneGroups/endpoint-dnszonegroup/privateDnsZoneConfigs/privatelink.dfs.core.windows.net"
              - name                = "privatelink.dfs.core.windows.net"
              - private_dns_zone_id = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.dfs.core.windows.net"
              - record_sets         = [
                  - {
                      - fqdn         = "ingest05workspacesbox.privatelink.dfs.core.windows.net"
                      - ip_addresses = [
                          - "10.247.13.19",
                        ]
                      - name         = "ingest05workspacesbox"
                      - ttl          = 10
                      - type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
      ~ resource_group_name           = "ingest05-storage-sbox" -> "ingest05-main-sbox" # forces replacement
        tags                          = {
            "Data-Ingest-Project" = "Crime Legacy Migration"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "true"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
            "startupMode"         = "always"
        }
        # (3 unchanged attributes hidden)

      ~ private_dns_zone_group {
          ~ id                   = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest05-storage-sbox/providers/Microsoft.Network/privateEndpoints/ingest05-workspace-dfs-pe-sbox/privateDnsZoneGroups/endpoint-dnszonegroup" -> (known after apply)
            name                 = "endpoint-dnszonegroup"
            # (1 unchanged attribute hidden)
        }

      ~ private_service_connection {
            name                              = "ingest05workspacesbox"
          ~ private_connection_resource_id    = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest05-storage-sbox/providers/Microsoft.Storage/storageAccounts/ingest05workspacesbox" -> (known after apply) # forces replacement
          ~ private_ip_address                = "10.247.13.19" -> (known after apply)
            # (4 unchanged attributes hidden)
        }
    }

  # module.data_landing_zone["05"].module.synapse_pe["dev"].azurerm_private_endpoint.this must be replaced
-/+ resource "azurerm_private_endpoint" "this" {
      ~ custom_dns_configs            = [] -> (known after apply)
      ~ id                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest05-shared-product-sbox/providers/Microsoft.Network/privateEndpoints/ingest05-product-synapse001-dev-pe-sbox" -> (known after apply)
        name                          = "ingest05-product-synapse001-dev-pe-sbox"
      ~ network_interface             = [
          - {
              - id   = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest05-shared-product-sbox/providers/Microsoft.Network/networkInterfaces/ingest05-product-synapse001-dev-pe-sbox.nic.4ca76327-2f80-4b57-a1ce-fc06342dd141"
              - name = "ingest05-product-synapse001-dev-pe-sbox.nic.4ca76327-2f80-4b57-a1ce-fc06342dd141"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs      = [
          - {
              - id                  = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest05-shared-product-sbox/providers/Microsoft.Network/privateEndpoints/ingest05-product-synapse001-dev-pe-sbox/privateDnsZoneGroups/endpoint-dnszonegroup/privateDnsZoneConfigs/privatelink.dev.azuresynapse.net"
              - name                = "privatelink.dev.azuresynapse.net"
              - private_dns_zone_id = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.dev.azuresynapse.net"
              - record_sets         = [
                  - {
                      - fqdn         = "ingest05-product-synapse001-sbox.privatelink.dev.azuresynapse.net"
                      - ip_addresses = [
                          - "10.247.13.25",
                        ]
                      - name         = "ingest05-product-synapse001-sbox"
                      - ttl          = 10
                      - type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
      ~ resource_group_name           = "ingest05-shared-product-sbox" -> "ingest05-main-sbox" # forces replacement
        tags                          = {
            "Data-Ingest-Project" = "Crime Legacy Migration"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "true"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
            "startupMode"         = "always"
        }
        # (3 unchanged attributes hidden)

      ~ private_dns_zone_group {
          ~ id                   = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest05-shared-product-sbox/providers/Microsoft.Network/privateEndpoints/ingest05-product-synapse001-dev-pe-sbox/privateDnsZoneGroups/endpoint-dnszonegroup" -> (known after apply)
            name                 = "endpoint-dnszonegroup"
            # (1 unchanged attribute hidden)
        }

      ~ private_service_connection {
            name                              = "ingest05-product-synapse001-sbox"
          ~ private_connection_resource_id    = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest05-shared-product-sbox/providers/Microsoft.Synapse/workspaces/ingest05-product-synapse001-sbox" -> (known after apply) # forces replacement
          ~ private_ip_address                = "10.247.13.25" -> (known after apply)
            # (4 unchanged attributes hidden)
        }
    }

  # module.data_landing_zone["05"].module.synapse_pe["sql"].azurerm_private_endpoint.this must be replaced
-/+ resource "azurerm_private_endpoint" "this" {
      ~ custom_dns_configs            = [] -> (known after apply)
      ~ id                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest05-shared-product-sbox/providers/Microsoft.Network/privateEndpoints/ingest05-product-synapse001-sql-pe-sbox" -> (known after apply)
        name                          = "ingest05-product-synapse001-sql-pe-sbox"
      ~ network_interface             = [
          - {
              - id   = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest05-shared-product-sbox/providers/Microsoft.Network/networkInterfaces/ingest05-product-synapse001-sql-pe-sbox.nic.18b076c4-0054-49e0-abeb-46bf4d2c2185"
              - name = "ingest05-product-synapse001-sql-pe-sbox.nic.18b076c4-0054-49e0-abeb-46bf4d2c2185"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs      = [
          - {
              - id                  = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest05-shared-product-sbox/providers/Microsoft.Network/privateEndpoints/ingest05-product-synapse001-sql-pe-sbox/privateDnsZoneGroups/endpoint-dnszonegroup/privateDnsZoneConfigs/privatelink.sql.azuresynapse.net"
              - name                = "privatelink.sql.azuresynapse.net"
              - private_dns_zone_id = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.sql.azuresynapse.net"
              - record_sets         = [
                  - {
                      - fqdn         = "ingest05-product-synapse001-sbox.privatelink.sql.azuresynapse.net"
                      - ip_addresses = [
                          - "10.247.13.24",
                        ]
                      - name         = "ingest05-product-synapse001-sbox"
                      - ttl          = 10
                      - type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
      ~ resource_group_name           = "ingest05-shared-product-sbox" -> "ingest05-main-sbox" # forces replacement
        tags                          = {
            "Data-Ingest-Project" = "Crime Legacy Migration"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "true"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
            "startupMode"         = "always"
        }
        # (3 unchanged attributes hidden)

      ~ private_dns_zone_group {
          ~ id                   = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest05-shared-product-sbox/providers/Microsoft.Network/privateEndpoints/ingest05-product-synapse001-sql-pe-sbox/privateDnsZoneGroups/endpoint-dnszonegroup" -> (known after apply)
            name                 = "endpoint-dnszonegroup"
            # (1 unchanged attribute hidden)
        }

      ~ private_service_connection {
            name                              = "ingest05-product-synapse001-sbox"
          ~ private_connection_resource_id    = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest05-shared-product-sbox/providers/Microsoft.Synapse/workspaces/ingest05-product-synapse001-sbox" -> (known after apply) # forces replacement
          ~ private_ip_address                = "10.247.13.24" -> (known after apply)
            # (4 unchanged attributes hidden)
        }
    }

  # module.data_landing_zone["05"].module.synapse_pe["sqlOnDemand"].azurerm_private_endpoint.this must be replaced
-/+ resource "azurerm_private_endpoint" "this" {
      ~ custom_dns_configs            = [] -> (known after apply)
      ~ id                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest05-shared-product-sbox/providers/Microsoft.Network/privateEndpoints/ingest05-product-synapse001-sqlOnDemand-pe-sbox" -> (known after apply)
        name                          = "ingest05-product-synapse001-sqlOnDemand-pe-sbox"
      ~ network_interface             = [
          - {
              - id   = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest05-shared-product-sbox/providers/Microsoft.Network/networkInterfaces/ingest05-product-synapse001-sqlOnDemand-pe-.nic.3cdf7e2d-6850-4577-b3eb-01f85738efd6"
              - name = "ingest05-product-synapse001-sqlOnDemand-pe-.nic.3cdf7e2d-6850-4577-b3eb-01f85738efd6"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs      = [
          - {
              - id                  = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest05-shared-product-sbox/providers/Microsoft.Network/privateEndpoints/ingest05-product-synapse001-sqlOnDemand-pe-sbox/privateDnsZoneGroups/endpoint-dnszonegroup/privateDnsZoneConfigs/privatelink.sql.azuresynapse.net"
              - name                = "privatelink.sql.azuresynapse.net"
              - private_dns_zone_id = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.sql.azuresynapse.net"
              - record_sets         = [
                  - {
                      - fqdn         = "ingest05-product-synapse001-sbox-ondemand.privatelink.sql.azuresynapse.net"
                      - ip_addresses = [
                          - "10.247.13.26",
                        ]
                      - name         = "ingest05-product-synapse001-sbox-ondemand"
                      - ttl          = 10
                      - type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
      ~ resource_group_name           = "ingest05-shared-product-sbox" -> "ingest05-main-sbox" # forces replacement
        tags                          = {
            "Data-Ingest-Project" = "Crime Legacy Migration"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "true"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
            "startupMode"         = "always"
        }
        # (3 unchanged attributes hidden)

      ~ private_dns_zone_group {
          ~ id                   = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest05-shared-product-sbox/providers/Microsoft.Network/privateEndpoints/ingest05-product-synapse001-sqlOnDemand-pe-sbox/privateDnsZoneGroups/endpoint-dnszonegroup" -> (known after apply)
            name                 = "endpoint-dnszonegroup"
            # (1 unchanged attribute hidden)
        }

      ~ private_service_connection {
            name                              = "ingest05-product-synapse001-sbox"
          ~ private_connection_resource_id    = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest05-shared-product-sbox/providers/Microsoft.Synapse/workspaces/ingest05-product-synapse001-sbox" -> (known after apply) # forces replacement
          ~ private_ip_address                = "10.247.13.26" -> (known after apply)
            # (4 unchanged attributes hidden)
        }
    }

  # module.data_landing_zone["05"].module.legacy_database["legacy-sql"].module.vm-bootstrap[0].azurerm_monitor_data_collection_rule_association.linux_vm_dcra[0] must be replaced
-/+ resource "azurerm_monitor_data_collection_rule_association" "linux_vm_dcra" {
      ~ id                          = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest05-metadata-sbox/providers/Microsoft.Compute/virtualMachines/ingest05-legacy-sql-sbox/providers/Microsoft.Insights/dataCollectionRuleAssociations/vm-ingest05-legacy-sql-sbox-dcra" -> (known after apply)
      ~ name                        = "vm-ingest05-legacy-sql-sbox-dcra" -> (known after apply) # forces replacement
      ~ target_resource_id          = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest05-metadata-sbox/providers/Microsoft.Compute/virtualMachines/ingest05-legacy-sql-sbox" -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.data_landing_zone["05"].module.legacy_database["legacy-sql"].module.vm-bootstrap[0].azurerm_virtual_machine_extension.azure_monitor[0] must be replaced
-/+ resource "azurerm_virtual_machine_extension" "azure_monitor" {
      - automatic_upgrade_enabled   = false -> null
      ~ id                          = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest05-metadata-sbox/providers/Microsoft.Compute/virtualMachines/ingest05-legacy-sql-sbox/extensions/AMALinux" -> (known after apply)
        name                        = "AMALinux"
      - provision_after_extensions  = [] -> null
        tags                        = {
            "Data-Ingest-Project" = "Crime Legacy Migration"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "true"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
            "startupMode"         = "always"
        }
      ~ virtual_machine_id          = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest05-metadata-sbox/providers/Microsoft.Compute/virtualMachines/ingest05-legacy-sql-sbox" -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)
    }

  # module.data_landing_zone["05"].module.legacy_database["legacy-sql"].module.vm-bootstrap[0].azurerm_virtual_machine_extension.custom_script[0] must be replaced
-/+ resource "azurerm_virtual_machine_extension" "custom_script" {
      - automatic_upgrade_enabled   = false -> null
      ~ id                          = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest05-metadata-sbox/providers/Microsoft.Compute/virtualMachines/ingest05-legacy-sql-sbox/extensions/HMCTSVMBootstrap" -> (known after apply)
        name                        = "HMCTSVMBootstrap"
      - provision_after_extensions  = [] -> null
        tags                        = {
            "Data-Ingest-Project" = "Crime Legacy Migration"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "true"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
            "startupMode"         = "always"
        }
      ~ virtual_machine_id          = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest05-metadata-sbox/providers/Microsoft.Compute/virtualMachines/ingest05-legacy-sql-sbox" -> (known after apply) # forces replacement
        # (6 unchanged attributes hidden)
    }

Plan: 162 to add, 18 to change, 192 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":113,"Program":"tfcmt","SHA1":"","Target":"883: sbox_landing - TerraformPlanApply","Vars":{}} -->